Revit 2024 API
BendingDetailCustomFieldProperties.AngularDimensionsMeasurementOptions Property
 Identifies the measurement option for angular dimensions.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public BendingDetailAngularDimensionsMeasurementOptions AngularDimensionsMeasurementOptions { get; set; }
Visual Basic
Public Property AngularDimensionsMeasurementOptions As BendingDetailAngularDimensionsMeasurementOptions
	Get
	Set
Visual C++
public:
property BendingDetailAngularDimensionsMeasurementOptions AngularDimensionsMeasurementOptions {
	BendingDetailAngularDimensionsMeasurementOptions get ();
	void set (BendingDetailAngularDimensionsMeasurementOptions value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
BendingDetailCustomFieldProperties Class
Autodesk.Revit.DB.Structure Namespace